# Pandas

In [1]:
""""
pip install pandas   ------> to install pandas in vs code
import pandas as pd  (importing pandas and giving "pd" as alias name)

Panda is a python library used for manipulation and analysis.
It has 2 data structure:-
1)Series
2)Data frame

"""

'"\npip install pandas   ------> to install pandas in vs code\nimport pandas as pd  (importing pandas and giving "pd" as alias name)\n\nPanda is a python library used for manipulation and analysis.\nIt has 2 data structure:-\n1)Series\n2)Data frame\n\n'

In [2]:
import pandas as pd
import numpy as np

### 1)Series

In [3]:
# creating a series

ser = pd.Series() 
print("Pandas Series: ", ser,'\n') 

data = np.array(['g', 'e', 'e', 'k', 's']) 
  
ser = pd.Series(data) 
print("Pandas Series:\n", ser)

Pandas Series:  Series([], dtype: object)

Pandas Series:
 0    g
1    e
2    e
3    k
4    s
dtype: object

In [4]:
s1=pd.Series([10,20,30,40,'hello',[1,2,4]])
print(s1)
print("***************************************************************************************************")
print(type(s1))
print("***************************************************************************************************")

s1[4]='hi'
s2=pd.Series([1,2,3,4,'world',[9]])
print(s1+s2)
print("***************************************************************************************************")
print(s1)
print("***************************************************************************************************")
print(s2)
print("***************************************************************************************************")
print(s1[4])

0           10
1           20
2           30
3           40
4        hello
5    [1, 2, 4]
dtype: object
***************************************************************************************************
<class 'pandas.core.series.Series'>
***************************************************************************************************
0              11
1              22
2              33
3              44
4         hiworld
5    [1, 2, 4, 9]
dtype: object
***************************************************************************************************
0           10
1           20
2           30
3           40
4           hi
5    [1, 2, 4]
dtype: object
***************************************************************************************************
0        1
1        2
2        3
3        4
4    world
5      [9]
dtype: object
***************************************************************************************************
hi

In [5]:
s3=pd.Series([1,2,3,4,5,6,7,8,9],name="marks")
print(s3)
s4=s3[3:8:2]
print(s4)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: marks, dtype: int64
3    4
5    6
7    8
Name: marks, dtype: int64

### 2)Data frame

In [6]:
df=pd.DataFrame({"Name":['Yami','Deepa',],
                 "Marks":[69,96],
                 "Rollno":[76,129]})

df

    Name  Marks  Rollno
0   Yami     69      76
1  Deepa     96     129

In [7]:
# DATA FRAMES

df1=pd.DataFrame({"Name":['Yami','Deepa','Yamini','Deepika','Deeya'],
                 "Ratings":['1*','1','2*','2','1*'],
                 "Qualification":['MCA','MCA','BCA','BCA','B.Tech']})

df1

      Name Ratings Qualification
0     Yami      1*           MCA
1    Deepa       1           MCA
2   Yamini      2*           BCA
3  Deepika       2           BCA
4    Deeya      1*        B.Tech

In [8]:
"""
pd.read_csv is used to read the file in this we read file that is in same folder

"""
d1=pd.read_csv('flipkart_sales.csv')
d1

,Order ID,Product Name,Category,Price (INR),Quantity Sold,Total Sales (INR),Order Date,Payment Method,Customer Rating
0,ORD00001,Educational Book,Books,49069.56,2,98139.12,2024-09-12,Debit Card,3.5
1,ORD00002,Jeans,Clothing,12755.85,4,51023.40,2024-12-18,UPI,3.9
2,ORD00003,Face Cream,Beauty,11092.19,4,44368.76,2024-05-18,Debit Card,4.4
3,ORD00004,Smartwatch,Electronics,32657.81,1,32657.81,2024-11-08,Debit Card,3.2
4,ORD00005,Cookware Set,Home & Kitchen,26590.08,3,79770.24,2024-12-27,UPI,3.1
...,...,...,...,...,...,...,...,...,...
995,ORD00996,Smartphone,Electronics,28995.81,3,86987.43,2025-01-13,COD,5.0
996,ORD00997,Perfume,Beauty,32799.51,2,65599.02,2024-12-18,Wallet,2.4
997,ORD00998,Face Cream,Beauty,40840.80,1,40840.80,2024-07-26,UPI,3.1
998,ORD00999,Cookware Set,Home & Kitchen,34741.79,4,138967.16,2024-10-02,Net Banking,3.2
999,ORD01000,Table Lamp,Home & Kitchen,16698.12,4,66792.48,2024-03-26,Credit Card,1.6

In [9]:
d1['Product Name']           # accesing column

0      Educational Book
1                 Jeans
2            Face Cream
3            Smartwatch
4          Cookware Set
             ...
995          Smartphone
996             Perfume
997          Face Cream
998        Cookware Set
999          Table Lamp
Name: Product Name, Length: 1000, dtype: object

In [10]:
# here we read a file from a link of github
d2=pd.read_csv('https://raw.githubusercontent.com/whoknowayush/DataAnalysis-Dataset/refs/heads/main/Datasets-Practice/hr_data.csv')
d2

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [11]:
# its a 2-D and consistsof row& series
# syntax :- pd.DataFrame(dictionaty)

# Creating a dictionary
data1 = {
    "emp_name": ["Rahul", "Priya", "Aman", "Sneha", "Karan", "Meera", "Vikas", "Anita", "Rohit", "Tina"],
    "emp_loc": ["Delhi", "Mumbai", "Bangalore", "Chennai", "Pune", "Hyderabad", "Kolkata", "Jaipur", "Surat", "Noida"],
    "emp_sal": [45000, 52000, 48000, 50000, 47000, 55000, 53000, 46000, 60000, 49000],
    "emp_designation": ["Developer", "Analyst", "Tester", "Manager", "Designer", "HR", "Developer", "Analyst", "Manager", "Tester"],
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110]
}

# Creating DataFrame
emp_df = pd.DataFrame(data1)
emp_df

  emp_name    emp_loc  emp_sal emp_designation  emp_id
0    Rahul      Delhi    45000       Developer     101
1    Priya     Mumbai    52000         Analyst     102
2     Aman  Bangalore    48000          Tester     103
3    Sneha    Chennai    50000         Manager     104
4    Karan       Pune    47000        Designer     105
5    Meera  Hyderabad    55000              HR     106
6    Vikas    Kolkata    53000       Developer     107
7    Anita     Jaipur    46000         Analyst     108
8    Rohit      Surat    60000         Manager     109
9     Tina      Noida    49000          Tester     110

In [12]:
data2 = {
    "cust_name": ["Arjun", "Nisha", "Ravi", "Simran", "Kunal",
                  "Meera", "Varun", "Pooja", "Sahil", "Ananya"],
    "phno": [9876543210, 9123456780, 9988776655, 9090909090, 9112233445,
             9001122334, 9898989898, 9223344556, 9332211000, 9887766554],
    "rating": [4.5, 4.0, 3.8, 5.0, 4.2, 4.1, 3.9, 4.7, 4.3, 4.8]
}

cust_df = pd.DataFrame(data2)
cust_df

  cust_name        phno  rating
0     Arjun  9876543210     4.5
1     Nisha  9123456780     4.0
2      Ravi  9988776655     3.8
3    Simran  9090909090     5.0
4     Kunal  9112233445     4.2
5     Meera  9001122334     4.1
6     Varun  9898989898     3.9
7     Pooja  9223344556     4.7
8     Sahil  9332211000     4.3
9    Ananya  9887766554     4.8

In [13]:
d2=pd.read_csv('https://raw.githubusercontent.com/whoknowayush/DataAnalysis-Dataset/refs/heads/main/Datasets-Practice/hr_data.csv')
d2

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [14]:
d2.head()                  # gives by default only first 5 rows

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low

In [15]:
d2.head(10)                # gives first n no. of  rows

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
5,1060,2,153,3,0,1,0,sales,low
6,1061,6,247,4,0,1,0,sales,low
7,1576,5,259,5,0,1,0,sales,low
8,1752,5,224,5,0,1,0,sales,low
9,1988,2,142,3,0,1,0,sales,low

In [16]:
d2.tail()                  # gives by default only last 5 rows

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [17]:
d2.tail(10)                # gives last n no. of  rows

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
14989,87638,2,159,3,1,1,0,technical,low
14990,87639,5,228,5,1,1,0,support,low
14991,87654,6,257,4,0,1,0,support,low
14992,87656,2,155,3,0,1,0,support,low
14993,87661,6,293,6,0,1,0,support,low
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [18]:
d2.describe()              # overall statistic of the numerical data present inside dataset

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000
mean,45424.627575,3.803054,201.050337,3.498233,0.144610,0.238083,0.021268
std,25915.900127,1.232592,49.943099,1.460136,0.351719,0.425924,0.144281
min,1003.000000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,22872.500000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,45448.000000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,67480.500000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,99815.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

In [19]:
d2.info()                  # provides information of each column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            14999 non-null  int64
 1   number_project         14999 non-null  int64
 2   average_montly_hours   14999 non-null  int64
 3   time_spend_company     14999 non-null  int64
 4   Work_accident          14999 non-null  int64
 5   left                   14999 non-null  int64
 6   promotion_last_5years  14999 non-null  int64
 7   department             14999 non-null  object
 8   salary                 14999 non-null  object
dtypes: int64(7), object(2)
memory usage: 1.0+ MB

In [20]:
d2.columns                 # gives all columns name

Index(['employee_id', 'number_project', 'average_montly_hours',
       'time_spend_company', 'Work_accident', 'left', 'promotion_last_5years',
       'department', 'salary'],
      dtype='object')

In [21]:
# d1.loc[row_slicing,column_slicing]
d1.loc[1:10,['Order ID','Category']]                          # if multiple row are there wrap it inside squre bracket

    Order ID        Category
1   ORD00002        Clothing
2   ORD00003          Beauty
3   ORD00004     Electronics
4   ORD00005  Home & Kitchen
5   ORD00006  Home & Kitchen
6   ORD00007        Clothing
7   ORD00008  Home & Kitchen
8   ORD00009        Clothing
9   ORD00010     Electronics
10  ORD00011          Beauty

In [22]:
d1.loc[[1,2,5,7,9,13],['Order ID','Category']]                # it is used to retrive row and columns

    Order ID        Category
1   ORD00002        Clothing
2   ORD00003          Beauty
5   ORD00006  Home & Kitchen
7   ORD00008  Home & Kitchen
9   ORD00010     Electronics
13  ORD00014     Electronics

In [23]:
# d1.iloc[row_slicing,column_slicing]                         # it will take row index and column index
d1.iloc[0:15,0:7]

,Order ID,Product Name,Category,Price (INR),Quantity Sold,Total Sales (INR),Order Date
0,ORD00001,Educational Book,Books,49069.56,2,98139.12,2024-09-12
1,ORD00002,Jeans,Clothing,12755.85,4,51023.40,2024-12-18
2,ORD00003,Face Cream,Beauty,11092.19,4,44368.76,2024-05-18
3,ORD00004,Smartwatch,Electronics,32657.81,1,32657.81,2024-11-08
4,ORD00005,Cookware Set,Home & Kitchen,26590.08,3,79770.24,2024-12-27
5,ORD00006,Mixer Grinder,Home & Kitchen,10475.03,2,20950.06,2024-10-22
6,ORD00007,Sneakers,Clothing,38647.72,3,115943.16,2024-07-04
7,ORD00008,Table Lamp,Home & Kitchen,24818.59,3,74455.77,2024-12-27
8,ORD00009,Jacket,Clothing,1987.39,2,3974.78,2025-01-18
9,ORD00010,Tablet,Electronics,26876.51,2,53753.02,2024-03-14
10,ORD00011,Perfume,Beauty,46409.57,5,232047.85,2025-02-08
11,ORD00012,Lipstick,Beauty,48780.78,5,243903.90,2024-04-13
12,ORD00013,Educational Book,Books,6670.82,5,33354.10,2024-02-23
13,ORD00014,Smartphone,Electronics,10826.05,1,10826.05,2024-06-02
14,ORD00015,Comic Book,Books,6839.10,1,6839.10,2024-09-12

In [24]:
d1.iloc[[1,2,4,6],[2,3,5,8]]

         Category  Price (INR)  Total Sales (INR)  Customer Rating
1        Clothing     12755.85           51023.40              3.9
2          Beauty     11092.19           44368.76              4.4
4  Home & Kitchen     26590.08           79770.24              3.1
6        Clothing     38647.72          115943.16              2.0

In [25]:
emp_df['emp_exp'] = 2   # experience=2 years for all employees
emp_df

  emp_name    emp_loc  emp_sal emp_designation  emp_id  emp_exp
0    Rahul      Delhi    45000       Developer     101        2
1    Priya     Mumbai    52000         Analyst     102        2
2     Aman  Bangalore    48000          Tester     103        2
3    Sneha    Chennai    50000         Manager     104        2
4    Karan       Pune    47000        Designer     105        2
5    Meera  Hyderabad    55000              HR     106        2
6    Vikas    Kolkata    53000       Developer     107        2
7    Anita     Jaipur    46000         Analyst     108        2
8    Rohit      Surat    60000         Manager     109        2
9     Tina      Noida    49000          Tester     110        2

In [26]:
emp_df['emp_exp'] = [1, 3, 2, 4, 5, 1, 2, 3, 4, 6]
emp_df

  emp_name    emp_loc  emp_sal emp_designation  emp_id  emp_exp
0    Rahul      Delhi    45000       Developer     101        1
1    Priya     Mumbai    52000         Analyst     102        3
2     Aman  Bangalore    48000          Tester     103        2
3    Sneha    Chennai    50000         Manager     104        4
4    Karan       Pune    47000        Designer     105        5
5    Meera  Hyderabad    55000              HR     106        1
6    Vikas    Kolkata    53000       Developer     107        2
7    Anita     Jaipur    46000         Analyst     108        3
8    Rohit      Surat    60000         Manager     109        4
9     Tina      Noida    49000          Tester     110        6

In [27]:
cust_df['cust_description'] = "Regular Customer"
cust_df

  cust_name        phno  rating  cust_description
0     Arjun  9876543210     4.5  Regular Customer
1     Nisha  9123456780     4.0  Regular Customer
2      Ravi  9988776655     3.8  Regular Customer
3    Simran  9090909090     5.0  Regular Customer
4     Kunal  9112233445     4.2  Regular Customer
5     Meera  9001122334     4.1  Regular Customer
6     Varun  9898989898     3.9  Regular Customer
7     Pooja  9223344556     4.7  Regular Customer
8     Sahil  9332211000     4.3  Regular Customer
9    Ananya  9887766554     4.8  Regular Customer

In [28]:
cust_df['cust_description'] = ["Premium","Regular","New","Returning","VIP","Regular","New","Premium","Regular","VIP"]
cust_df

  cust_name        phno  rating cust_description
0     Arjun  9876543210     4.5          Premium
1     Nisha  9123456780     4.0          Regular
2      Ravi  9988776655     3.8              New
3    Simran  9090909090     5.0        Returning
4     Kunal  9112233445     4.2              VIP
5     Meera  9001122334     4.1          Regular
6     Varun  9898989898     3.9              New
7     Pooja  9223344556     4.7          Premium
8     Sahil  9332211000     4.3          Regular
9    Ananya  9887766554     4.8              VIP

In [29]:
d1=pd.DataFrame({'st_name':['pinkiu','harshit','chintu','karan','chintu'],
                  'st_id':[102,103,104,105,104],
                  'st_age':[16,17,18,15,18],
                  'st_ph':[9668193293,9556867980,9732145869,7788993344,9732145869],
                  'st_marks':[99,98,97,96,95]})
d1

   st_name  st_id  st_age       st_ph  st_marks
0   pinkiu    102      16  9668193293        99
1  harshit    103      17  9556867980        98
2   chintu    104      18  9732145869        97
3    karan    105      15  7788993344        96
4   chintu    104      18  9732145869        95

In [30]:
#change column
# st_ph----> st_phno
# st_mark--->st_score

d1.rename(columns={'st_ph':'st_phno','st_marks':'st_scores'},inplace=True)
d1

   st_name  st_id  st_age     st_phno  st_scores
0   pinkiu    102      16  9668193293         99
1  harshit    103      17  9556867980         98
2   chintu    104      18  9732145869         97
3    karan    105      15  7788993344         96
4   chintu    104      18  9732145869         95

In [31]:
#By default inplace=false which will not change permanently so we have to assign it True
d1.rename(columns={'st_id':'st_rollno','st_age':'age','st_name':'st'},inplace=True)
d1

        st  st_rollno  age     st_phno  st_scores
0   pinkiu        102   16  9668193293         99
1  harshit        103   17  9556867980         98
2   chintu        104   18  9732145869         97
3    karan        105   15  7788993344         96
4   chintu        104   18  9732145869         95

In [32]:
# it will remove the duplicates from the dataframe which are having same column but temporary
d1.drop_duplicates()
d1

        st  st_rollno  age     st_phno  st_scores
0   pinkiu        102   16  9668193293         99
1  harshit        103   17  9556867980         98
2   chintu        104   18  9732145869         97
3    karan        105   15  7788993344         96
4   chintu        104   18  9732145869         95

In [33]:
# but d1.drop_duplicates() will delete duplicate temporaryly to do it permanant we have to write  inplace=True

d1.drop_duplicates(inplace=True) 
d1 

# or we can write
d1=d1.drop_duplicates()
d1

        st  st_rollno  age     st_phno  st_scores
0   pinkiu        102   16  9668193293         99
1  harshit        103   17  9556867980         98
2   chintu        104   18  9732145869         97
3    karan        105   15  7788993344         96
4   chintu        104   18  9732145869         95

In [34]:
# upd_marks1={98:89,96:69,89:96,78:70}              # by using map if it will not find the key it will show NaN value to overcome it we use replace
# d1['st_scores']=d1['st_scores'].map(upd_marks1)
# d1

"""
output

	st	st_rollno	age	st_phno	st_scores
0	pinkiu	102	16	9668193293	NaN
1	harshit	103	17	9556867980	89.0
2	chintu	104	18	9732145869	NaN
3	karan	105	15	7788993344	69.0
4	chintu	104	18	9732145869	NaN


"""

'\noutput\n\n\tst\tst_rollno\tage\tst_phno\tst_scores\n0\tpinkiu\t102\t16\t9668193293\tNaN\n1\tharshit\t103\t17\t9556867980\t89.0\n2\tchintu\t104\t18\t9732145869\tNaN\n3\tkaran\t105\t15\t7788993344\t69.0\n4\tchintu\t104\t18\t9732145869\tNaN\n\n\n'

In [35]:
upd_marks2={98:89,96:69,89:96,78:70}                   # it will not show NaN it will replace
d1['st_scores']=d1['st_scores'].replace(upd_marks2)
d1

        st  st_rollno  age     st_phno  st_scores
0   pinkiu        102   16  9668193293         99
1  harshit        103   17  9556867980         89
2   chintu        104   18  9732145869         97
3    karan        105   15  7788993344         69
4   chintu        104   18  9732145869         95

In [36]:
emp=pd.DataFrame({'emp_name':['Kartik', 'Mohan','Sohan', 'Sahil','Karan','Arjun'],
                  'emp_id':[1234,1235,1236,1237,1238,1239],
                  'emp_role':['SE','SE','ASE','JSE','OA','DS'],
                  'emp_years':[2,2,1,1,4,5]})
emp

  emp_name  emp_id emp_role  emp_years
0   Kartik    1234       SE          2
1    Mohan    1235       SE          2
2    Sohan    1236      ASE          1
3    Sahil    1237      JSE          1
4    Karan    1238       OA          4
5    Arjun    1239       DS          5

In [37]:
emp.rename(columns={'emp_role':'emp_designation','emp_years':'emp_exp'},inplace=True)    # inplace=True means change permanantly
emp

  emp_name  emp_id emp_designation  emp_exp
0   Kartik    1234              SE        2
1    Mohan    1235              SE        2
2    Sohan    1236             ASE        1
3    Sahil    1237             JSE        1
4    Karan    1238              OA        4
5    Arjun    1239              DS        5

In [38]:
emp['emp_exp']=emp['emp_exp'].replace({1:2})
emp

  emp_name  emp_id emp_designation  emp_exp
0   Kartik    1234              SE        2
1    Mohan    1235              SE        2
2    Sohan    1236             ASE        2
3    Sahil    1237             JSE        2
4    Karan    1238              OA        4
5    Arjun    1239              DS        5

In [39]:
emp['emp_designation']=emp['emp_designation'].map({'SE':'SR.SE','ASE':'SE','JSE':'ASE','OA':'OS','DS':'SRDS'})
emp

  emp_name  emp_id emp_designation  emp_exp
0   Kartik    1234           SR.SE        2
1    Mohan    1235           SR.SE        2
2    Sohan    1236              SE        2
3    Sahil    1237             ASE        2
4    Karan    1238              OS        4
5    Arjun    1239            SRDS        5

In [40]:
d3 = pd.read_csv('https://raw.githubusercontent.com/whoknowayush/DataAnalysis-Dataset/main/Datasets-Practice/amazon_fires.csv',encoding='ISO-8859-1')
d3

       ano       mes     estado   numero  encontro
0     1998   Janeiro       Acre  0 Fires  1/1/1998
1     1999   Janeiro       Acre  0 Fires  1/1/1999
2     2000   Janeiro       Acre  0 Fires  1/1/2000
3     2001   Janeiro       Acre  0 Fires  1/1/2001
4     2002   Janeiro       Acre  0 Fires  1/1/2002
...    ...       ...        ...      ...       ...
6449  2012  Dezembro  Tocantins      128  1/1/2012
6450  2013  Dezembro  Tocantins       85  1/1/2013
6451  2014  Dezembro  Tocantins      223  1/1/2014
6452  2015  Dezembro  Tocantins      373  1/1/2015
6453  2016  Dezembro  Tocantins      119  1/1/2016

[6454 rows x 5 columns]

In [41]:
print(d3.info())
d3.rename(columns={'ano':'year','mes':'month','estado':'state','numero':'number_of_fire','encontro':'Date'},inplace=True)
d3

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ano       6454 non-null   int64
 1   mes       6454 non-null   object
 2   estado    6454 non-null   object
 3   numero    6322 non-null   object
 4   encontro  6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB
None

      year     month      state number_of_fire      Date
0     1998   Janeiro       Acre        0 Fires  1/1/1998
1     1999   Janeiro       Acre        0 Fires  1/1/1999
2     2000   Janeiro       Acre        0 Fires  1/1/2000
3     2001   Janeiro       Acre        0 Fires  1/1/2001
4     2002   Janeiro       Acre        0 Fires  1/1/2002
...    ...       ...        ...            ...       ...
6449  2012  Dezembro  Tocantins            128  1/1/2012
6450  2013  Dezembro  Tocantins             85  1/1/2013
6451  2014  Dezembro  Tocantins            223  1/1/2014
6452  2015  Dezembro  Tocantins            373  1/1/2015
6453  2016  Dezembro  Tocantins            119  1/1/2016

[6454 rows x 5 columns]

In [42]:
d3.duplicated().sum()

np.int64(30)

In [43]:
d3['month'].value_counts()
d3.drop_duplicates(inplace=True)
d3

      year     month      state number_of_fire      Date
0     1998   Janeiro       Acre        0 Fires  1/1/1998
1     1999   Janeiro       Acre        0 Fires  1/1/1999
2     2000   Janeiro       Acre        0 Fires  1/1/2000
3     2001   Janeiro       Acre        0 Fires  1/1/2001
4     2002   Janeiro       Acre        0 Fires  1/1/2002
...    ...       ...        ...            ...       ...
6449  2012  Dezembro  Tocantins            128  1/1/2012
6450  2013  Dezembro  Tocantins             85  1/1/2013
6451  2014  Dezembro  Tocantins            223  1/1/2014
6452  2015  Dezembro  Tocantins            373  1/1/2015
6453  2016  Dezembro  Tocantins            119  1/1/2016

[6424 rows x 5 columns]

In [44]:
d3['month'] = d3['month'].str.strip().str.lower()
d3

      year     month      state number_of_fire      Date
0     1998   janeiro       Acre        0 Fires  1/1/1998
1     1999   janeiro       Acre        0 Fires  1/1/1999
2     2000   janeiro       Acre        0 Fires  1/1/2000
3     2001   janeiro       Acre        0 Fires  1/1/2001
4     2002   janeiro       Acre        0 Fires  1/1/2002
...    ...       ...        ...            ...       ...
6449  2012  dezembro  Tocantins            128  1/1/2012
6450  2013  dezembro  Tocantins             85  1/1/2013
6451  2014  dezembro  Tocantins            223  1/1/2014
6452  2015  dezembro  Tocantins            373  1/1/2015
6453  2016  dezembro  Tocantins            119  1/1/2016

[6424 rows x 5 columns]

In [45]:
d3['month'].unique()

array(['janeiro', 'fevereiro', 'março', 'abril', 'maio', 'junho', 'julho',
       'agosto', 'setembro', 'outubro', 'novembro', 'dezembro'],
      dtype=object)

In [46]:
# to change or update row value use map function
# inclue all the unique values otherwise it will provide NaN value

month_map = {
    'janeiro': 'January',
    'fevereiro': 'February',
    'março': 'March',
    'abril': 'April',
    'maio': 'May',
    'junho': 'June',
    'julho': 'July',
    'agosto': 'August',
    'setembro': 'September',
    'outubro': 'October',
    'novembro': 'November',
    'dezembro': 'December'
}

d3['month'] = d3['month'].map(month_map)
d3

      year     month      state number_of_fire      Date
0     1998   January       Acre        0 Fires  1/1/1998
1     1999   January       Acre        0 Fires  1/1/1999
2     2000   January       Acre        0 Fires  1/1/2000
3     2001   January       Acre        0 Fires  1/1/2001
4     2002   January       Acre        0 Fires  1/1/2002
...    ...       ...        ...            ...       ...
6449  2012  December  Tocantins            128  1/1/2012
6450  2013  December  Tocantins             85  1/1/2013
6451  2014  December  Tocantins            223  1/1/2014
6452  2015  December  Tocantins            373  1/1/2015
6453  2016  December  Tocantins            119  1/1/2016

[6424 rows x 5 columns]